/**
 * 九里半街道マップの設定ファイル
 */

const MAP_CONFIG = {
    // Cesium Ionアクセストークン
    cesiumToken: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJqdGkiOiIyOGRiZmY3Yy0wNzRjLTQ2MjktOGQ0Ni0xYmI5MzFmNDUxZDAiLCJpZCI6MzU0MDY0LCJpYXQiOjE3NjE0NTQ3MDh9.p9q4yTuNNbVz7U09nx04n-LQG0sxXh8TDw22H3FSIV0",

    // 初期表示位置
    initialView: {
        longitude: 136.02,
        latitude: 35.37,
        height: 15000
    },

    // 3D地形
    terrain: {
        enabled: true,
        assetId: 2767062
    },

    // 線A（赤い点線）
    lineA: {
        enabled: true,           // この地図で使用する
        toggleable: true,       // ON/OFF切替不可（常に表示）
        defaultVisible: true,    // 初期表示ON
        coordinates: [
            [136.34026747483415, 35.205964151356866],
            [136.339767925555293, 35.206522703560395],
            [136.340688147911067, 35.207016804230143],
            [136.341319157526414, 35.207833137879973],
            [136.342896681564923, 35.208176854856227],
            [136.344342745266857, 35.208434641633573],
            [136.345210383487995, 35.208950212732979],
            [136.345631056564883, 35.210840612088582],
            [136.345999145507221, 35.211742832628175],
            [136.346551278920685, 35.213805013354808],
            [136.346656447189929, 35.214556837047724],
            [136.347392625074491, 35.215759740473558],
            [136.347340040939912, 35.216704866374656],
            [136.347418917141795, 35.217649981271236],
            [136.348102510891835, 35.217564062189922],
            [136.348339139497597, 35.21799365668705],
            [136.349785203199502, 35.217735900261602],
            [136.350521381084093, 35.218723962114048],
            [136.351914860651419, 35.219368343798614],
            [136.351967444786055, 35.220163074163857],
            [136.353571260891812, 35.220248990493971],
            [136.353571260891812, 35.220248990493971],
        ]
    },

    // 線B（黄色い半透明空中矢印）
    lineB: {
        enabled: true,
        toggleable: true,        // ON/OFF切替可能
        defaultVisible: true,    // 初期表示ON
        coordinates: [
            [
                [136.336810, 35.204672, 950], [136.346537, 35.216180, 1150], [136.351842, 35.220050, 1200],
            ]
        ]
    },

    // 引出線付きポイント・ラベル
    points: [
        { longitude: 136.339935, latitude: 35.205954, height: 150, name: "Start/\nFinish" },
        { longitude: 136.3536672, latitude: 35.2201805, height: 150, name: "高室山(818m)\nMt.Takamuro" },
            ],

    // 画像レイヤー設定
    layers: {
        satellite: true,         // 衛星画像を使用
        googleMaps: true,        // Google Maps を使用
        gsi: true,              // 地理院地図を使用
        oldMaps: [              // 使用する古地図（layerDefinitions.jsのキーを指定）
            'hikone_east'
        ]
    }
};

// グローバルに公開
window.MAP_CONFIG = MAP_CONFIG;